In [1]:
import pandas as pd
import numpy as np

In [7]:
data=pd.read_excel('data.xlsx')
display(data)

   ids     Name  Age Designation  Grade  Dept Salary
0   11    Talha   22     Officer     17        20000
1   23      Ali   33     Officer     17        30000
2   45     Zayn   65      Manger     14        40000
3   32   Younus   33        Boss     18        60000
4   44  Tanveer   23   Suervisor     19        12000
5   76     Safi   12  Supervisor     18        40333
6   44    Usman   22     Officer     14        23456

In [8]:
designation_group=data.groupby('Designation')
designation_group

In [9]:
designation_group=data.groupby('Designation').groups
designation_group

{'Boss': [3], 'Manger': [2], 'Officer': [0, 1, 6], 'Suervisor': [4], 'Supervisor': [5]}

In [10]:
designation_group=data.groupby('Designation')
designation_group.groups

{'Boss': [3], 'Manger': [2], 'Officer': [0, 1, 6], 'Suervisor': [4], 'Supervisor': [5]}

In [13]:
designation_group.get_group('Officer')

   ids   Name  Age Designation  Grade  Dept Salary
0   11  Talha   22     Officer     17        20000
1   23    Ali   33     Officer     17        30000
6   44  Usman   22     Officer     14        23456

In [14]:
group_GRade=data.groupby('Grade')
group_GRade.groups

{14: [2, 6], 17: [0, 1], 18: [3, 5], 19: [4]}

In [15]:
group_GRade.get_group(17)

   ids   Name  Age Designation  Grade  Dept Salary
0   11  Talha   22     Officer     17        20000
1   23    Ali   33     Officer     17        30000

In [16]:
designation_grade_group=data.groupby(['Designation','Grade'])

In [17]:
designation_grade_group.groups

{('Boss', 18): [3], ('Manger', 14): [2], ('Officer', 14): [6], ('Officer', 17): [0, 1], ('Suervisor', 19): [4], ('Supervisor', 18): [5]}

In [18]:
designation_grade_group.get_group(('Officer', 17))

   ids   Name  Age Designation  Grade  Dept Salary
0   11  Talha   22     Officer     17        20000
1   23    Ali   33     Officer     17        30000

In [19]:
designation_grade_group.get_group(('Boss', 18))

   ids    Name  Age Designation  Grade  Dept Salary
3   32  Younus   33        Boss     18        60000

In [20]:
designation_grade_group.agg('mean')

                    ids   Age  Dept Salary
Designation Grade
Boss        18     32.0  33.0      60000.0
Manger      14     45.0  65.0      40000.0
Officer     14     44.0  22.0      23456.0
            17     17.0  27.5      25000.0
Suervisor   19     44.0  23.0      12000.0
Supervisor  18     76.0  12.0      40333.0

In [21]:
designation_grade_group.agg('mean')['ids']

Designation  Grade
Boss         18       32.0
Manger       14       45.0
Officer      14       44.0
             17       17.0
Suervisor    19       44.0
Supervisor   18       76.0
Name: ids, dtype: float64

In [22]:
designation_grade_group.ids.agg('mean')

Designation  Grade
Boss         18       32.0
Manger       14       45.0
Officer      14       44.0
             17       17.0
Suervisor    19       44.0
Supervisor   18       76.0
Name: ids, dtype: float64

In [23]:
display(designation_group.groups)
display(designation_group.get_group('Boss'))
display(designation_group.describe())
display(designation_group.agg({'Age':np.min,'Dept Salary':np.max}))

{'Boss': [3], 'Manger': [2], 'Officer': [0, 1, 6], 'Suervisor': [4], 'Supervisor': [5]}

   ids    Name  Age Designation  Grade  Dept Salary
3   32  Younus   33        Boss     18        60000

              ids                                                  Age  \
            count  mean        std   min   25%   50%   75%   max count
Designation
Boss          1.0  32.0        NaN  32.0  32.0  32.0  32.0  32.0   1.0
Manger        1.0  45.0        NaN  45.0  45.0  45.0  45.0  45.0   1.0
Officer       3.0  26.0  16.703293  11.0  17.0  23.0  33.5  44.0   3.0
Suervisor     1.0  44.0        NaN  44.0  44.0  44.0  44.0  44.0   1.0
Supervisor    1.0  76.0        NaN  76.0  76.0  76.0  76.0  76.0   1.0

                        ... Grade       Dept Salary                \
                  mean  ...   75%   max       count          mean
Designation             ...
Boss         33.000000  ...  18.0  18.0         1.0  60000.000000
Manger       65.000000  ...  14.0  14.0         1.0  40000.000000
Officer      25.666667  ...  17.0  17.0         3.0  24485.333333
Suervisor    23.000000  ...  19.0  19.0         1.0  12000.000000
Supervisor   12.000000  ...  18.0  18.0         1.0  40333.000000


                     std      min      25%      50%      75%      max
Designation
Boss                 NaN  60000.0  60000.0  60000.0  60000.0  60000.0
Manger               NaN  40000.0  40000.0  40000.0  40000.0  40000.0
Officer      5078.842913  20000.0  21728.0  23456.0  26728.0  30000.0
Suervisor            NaN  12000.0  12000.0  12000.0  12000.0  12000.0
Supervisor           NaN  40333.0  40333.0  40333.0  40333.0  40333.0

[5 rows x 32 columns]

             Age  Dept Salary
Designation
Boss          33        60000
Manger        65        40000
Officer       22        30000
Suervisor     23        12000
Supervisor    12        40333

In [24]:
order_leads = pd.read_csv(
    'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/order_leads.csv',
    parse_dates = [3]
)
sales_team = pd.read_csv(
    'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/sales_team.csv',
    
)

In [25]:
display(order_leads.columns)

Index(['Order Id', 'Company Id', 'Company Name', 'Date', 'Order Value',
       'Converted'],
      dtype='object')

In [26]:
display(sales_team.columns)

Index(['Sales Rep', 'Sales Rep Id', 'Company Name', 'Company Id'], dtype='object')

In [27]:
order_leads['Company Name'].value_counts()

80Th Scorecard                      41
Contemporary Gardenia               39
Smashed-Out Intercept               39
Shrill Co-Op                        39
Geometric Abbot                     37
                                    ..
Unkempt Cop                          8
Despondent Knife-Grinder             8
Wee Song                             8
Hypothalamic-Cortical Leatherman     8
Above-Noted Flanders                 5
Name: Company Name, Length: 4619, dtype: int64

In [28]:
order_leads.head()

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0

In [30]:
order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [31]:
sales_team.head()

        Sales Rep      Sales Rep Id            Company Name        Company Id
0  William Taylor  ZTZA0ZLYZR85PTUJ  Melancholy Social-Role  D0AUXPP07H6AVSGD
1  William Taylor  ZTZA0ZLYZR85PTUJ          Pee-Wee Pigeon  TJW99R4RWH02INII
2  William Taylor  ZTZA0ZLYZR85PTUJ     Vaginal 36-Year-Old  3S20IO1O1DYXMUNU
3  William Taylor  ZTZA0ZLYZR85PTUJ    Unhurried Musician'S  FDWW0TQRPGMVI2A7
4  William Taylor  ZTZA0ZLYZR85PTUJ     Comprehensive Lists  C30FY83UNLVBA0O3

In [32]:
sales_team.value_counts()

Sales Rep          Sales Rep Id      Company Name             Company Id
Aaron Hendrickson  AEMLQ09IYM72ACBL  6-Foot Homosexuals       OBO1IDFAZIVFRG9A    1
Nancy Shorter      G99RFBBAJ2PX39K2  Nonspecific Brigadoon    3YSHEWGJRF7WB7KH    1
Mildred Vest       WJ34LXDCZWOF47U2  Chipper Tabernacles      TO0D263CK6STSGZN    1
                                     Chicago-Style Drawings   87KMD3BSCH6VUR62    1
                                     Black-Clad Paratroopers  9OYUQML6U2G1YCHR    1
                                                                                 ..
Gordon Harris      2LA5ID42LHQ98UEU  Goggle-Eyed Michaelson   12TNGGJQQLES865V    1
                                     Extensive Jealousies     GU530FVMO8H72TTP    1
                                     Creative 5/64''          SZLSWNJ9Z864U2NI    1
                                     Above-Mentioned Niger    N6C72P7XF8WYZM7U    1
Yvonne Lindsey     LBSKFCGCB0IZTMWN  Shrill Co-Op             IGOZET5TU8NF7FX0    1
Length: 4619, dtype: int64

In [33]:
order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [34]:
sales_team.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4619 entries, 0 to 4618
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales Rep     4619 non-null   object
 1   Sales Rep Id  4619 non-null   object
 2   Company Name  4619 non-null   object
 3   Company Id    4619 non-null   object
dtypes: object(4)
memory usage: 144.5+ KB

In [35]:
df=pd.merge(order_leads,sales_team,on=['Company Name','Company Id'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100000 entries, 0 to 99999
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
 6   Sales Rep     100000 non-null  object
 7   Sales Rep Id  100000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 6.9+ MB